org/2017/07/23/Overloading-mathematical-operators-in-elisp.org
** Addendum

Christopher Wellons [[http://disq.us/p/1kr76r9][pointed out]] an important limitation of advice: they don't work on byte-compiled functions. Let's see what he means. Here is a simple function that will just multiply a Point object by an integer:

#+BEGIN_SRC emacs-lisp
(defun to-be-bytten (p1 n)
  (* p1 n))
#+END_SRC

#+RESULTS:
: to-be-bytten

Here it is in action, and here it works fine.

#+BEGIN_SRC emacs-lisp
(to-be-bytten (Point :x 1 :y 1) 2)
#+END_SRC

#+RESULTS:
: [eieio-class-tag--Point 2 2]

Now, let's byte-compile that function and try it again:

#+BEGIN_SRC emacs-lisp
(byte-compile 'to-be-bytten)

(condition-case err
    (to-be-bytten (Point :x 1 :y 1) 2)
  ((error r)
   (message "Doh! Christopher was right. It did not work...\n%s" err)))
#+END_SRC

#+RESULTS:
: Doh! Christopher was right. It did not work...
: (wrong-type-argument number-or-marker-p [eieio-class-tag--Point 1 1])

So the advice is pretty limited since most of the functions in Emacs core are likely to be byte-compiled, and it might mean you have to redefine * completely, or define some new function that looks like it. Too bad, the advice was pretty easy! 

